package org.example.lessons.lesson03.homework

//1. Название мероприятия
val eventName: String = "Hackathon Survival"
//2. Дата проведения
var date: String = "28–30 November 2025"
//3. Место проведения
var place: String = "St. Petersburg, Citylink conferenc hall"
//4. Подробный бюджет мероприятия, включая расходы на оборудование, кейтеринг и другие операционные расходы.
private val detailBudget: String = "подробная информация с перечислением поставщиков и сумм для внутреннего пользования"
//5. Количество участников
var participantsCount: Int = 50
//6. Длительность хакатона (в часах)
val durationOfEvent: Int = 72
//7. Контактная информация и условия соглашений с поставщиками пищи, оборудования и других услуг.
private val contactInfoCateringAndServices: String = ""
//8. Текущее состояние хакатона (статус)
var eventStatus: String = "Planned"
//9. Список спонсоров
val listOfSponsors: String = "публичный список спонсоров мероприятия"
//10. Бюджет мероприятия
private var eventBudget: Int = 500000
//11. Текущий уровень доступа к интернету
var internetAccessLevel: String = "High"
//12. Информация о транспортировке оборудования, распределении ресурсов и координации между различными командами поддержки.
private var crossTeamResourceManagementPolicy: String = ""
//13. Количество команд
var teamCount: Int = 7
//14. Перечень задач
val taskList: String = ""
//15. План эвакуации
var evacuationPlan: String = ""
//16. Список доступного оборудования (всё, что выделено для использования на мероприятии)
val availableEvent: String = ""
//17. Список свободного оборудования (всё, что можно взять прямо сейчас и что не занято другими участниками)
var freeEquipment: String = ""
//18. График питания участников (зависит от поставщика питания, определяемого за неделю до начала)
lateinit var mealSchedule: String
//19. План мероприятий на случай сбоев
val contingencyPlan: String = ""
//20. Список экспертов и жюри
var expertsAndJury: String = ""
//21. Политика конфиденциальности
val privacyPolicy: String = ""
//22. Приватные отзывы (фидбэк) участников и зрителей для анализа проблем.
private lateinit var privateFeedback: String
//23. Текущая температура в помещении
var currentTemperature: Double = 22.5
//24. Данные мониторинга и анализ производительности сетевого оборудования и интернет-соединения для целей отладки своих приложений командами
lateinit var networkMonitoring: String
//25. Регулятор скорости интернета (понижающий коэффициент, например 0.5)
var internetChoke: Double = 0.6
//26. Уровень освещения
var lightingLevel: Int = 68
//27. Лог событий мероприятия
var eventLog: String = ""
//28. Возможность получения медицинской помощи прямо на мероприятии (да/нет)
val medicalSupport : Boolean = true
//29. Планы и процедуры для обеспечения безопасности мероприятия, включая планы эвакуации и протоколы чрезвычайных ситуаций.
var safetyProcedures: String = ""
//30. Регистрационный номер мероприятия
var registrationNumber: String = ""
//31. Максимально допустимый уровень шума в помещении хакатона.
var maxNoiseLevel: Int = 70
//32. Индикатор превышения уровня шума в помещениях (превышен или не превышен в данный момент)
var noiseExceeded: Boolean = false
//33. План взаимодействия с прессой
private var pressPlan: String = ""
//34. Детальная публичная информация о проектах каждой команды, сбор данных включает в себя компиляцию кода и сбор статистики прогона автоматизированных проверок.
lateinit var publicProjectInfo: String = ""
//35. Статус получения всех необходимых разрешений для проведения мероприятия
var permitStatuses: String = ""
//36. Индикатор доступности специализированного оборудования в данный момент (например, специальному оборудованию)
var specialEquipmentAvailable: String = ""
//37. Список партнеров мероприятия
var partnersList: String = "Список партнеров"
    private set
//38. Отчет, включающий фотографии, видео и отзывы, генерируется и становится доступен после завершения мероприятия.
var report: String by lazy { "Отчёт будет сгенерирован позже" }
//39. Внутренние правила распределения призов
private var prizeRules: String = ""
//40. Список разыгрываемых призов
var prizeList: String = ""
//41. Контактная информация экстренных служб, медицинского персонала и других важных служб, для внутреннего пользования.
var emergencyContacts: String = "112"
//42. Особые условия для участников с ограниченными возможностями
var accessibilityConditions: String = ""
//43. Общее настроение участников (определяется опросами)
var mood: String = ""
//44. Подробный план хакатона, включающий время и содержание каждого сегмента, инициализируется непосредственно перед началом мероприятия, так как зависит от фактического состава команд и взятых в работу задач.
lateinit var hackathonPlan: String
//45. Имя знаменитого специального гостя, которое будет объявлено за день до мероприятия, но в момент инициализации неизвестно.
lateinit var specialGuest: String
//46. Максимальное количество людей, которое может вместить место проведения.
val maxPeopleAtLocation: Int = 150
//47. Количество часов, отведенное каждой команде для работы над проектом.
val teamHours: Int = 65