package org.example.lessons.lesson05.homeworks

fun main() {
    println("=== Задача 1: затухание звука ===")
    task1()

    println("\n=== Задача 2: доставка и страховка ===")
    task2()

    println("\n=== Задача 3: атмосферное давление ===")
    task3()
}
//Задача 1
//Контекст: Вы изучаете физическое явление затухания звука в помещении.
// У вас есть измеренное значение начальной интенсивности звука, но из-за ограничений оборудования
// данные о коэффициенте затухания иногда могут быть неизвестны.
//Задача: Рассчитать предполагаемую интенсивность звука после затухания.
// Интенсивность звука после затухания пропорциональна начальной интенсивности,
// умноженной на коэффициент затухания. Если коэффициент затухания неизвестен, использовать стандартное значение 0.5.

    fun task1() {
//example 1
        val initialIntensity: Double = 10.0
        val attenuation: Double? = null
        val result = initialIntensity * (attenuation ?: 0.5)
        println("Итоговая интенсивность: $result")
    }

//Задача 2
//Контекст: Клиент оплачивает доставку груза. К стоимости доставки добавляется страховка на груз,
// которая составляет 0,5% от его стоимости. В случае, если стоимость не указана,
// то берётся стандартная стоимость в $50
//Задача: Рассчитать полную стоимость доставки.

    //example 2
    fun task2() {
        val deliveryPrice: Double? = null  // может быть null
        val finalDeliveryPrice = deliveryPrice ?: 50.0
        val cargoInsurance = finalDeliveryPrice * 0.005
        val fullCost = finalDeliveryPrice + cargoInsurance
        println("Полная стоимость доставки: $fullCost")
    }

//Задача 3
//Контекст: Вы проводите метеорологические измерения. Одним из важных показателей является атмосферное давление,
// которое должно быть зафиксировано. Лаборант приносит вам набор показателей, но по пути может что-нибудь потерять.
// Задача - сообщить об ошибке в случае отсутствия показаний атмосферного давления.

    //example 3
    fun task3() {
        val pressure: Double? = null  // может быть null
        val message = "Атмосферное давление: ${pressure ?: "Ошибка: данные отсутствуют"}"
        println(message)
    }